# Создаем переменную name и присваиваем ей значение
name = "John"
# Выводим значение переменной name на экран
print("Name:", name)

# Создаем переменную age и присваиваем ей значение
age = 25
# Выводим значение переменной age на экран
print("Age:", age)

# Перезаписываем переменную age с добавлением нового значения
age = age + 1  # Добавляем 1 к возрасту
# Выводим измененное значение переменной age на экран
print("New Age:", age)

# Создаем переменную is_student и присваиваем ей логическое значение
is_student = True
# Выводим значение переменной is_student на экран
print("Is Student:", is_student)

